[
    {
        "name": "Proarc EDMS",
        "githubLink": "https://www.ascertra.com/products/proarc-engineering-document-management-software",
        "techstacks": ".Net Core|Framework, c#, Powershell, Rest API, React, Angular, Azure, CI|CD, WPF, BICEP, ARM, YML, Docker etc",
        "description": [
            "Migrated From on-prem to PaaS: Moved all IIS components to Azure App services, leveraged all the Cloud services to replace On-prem solutions like storage accounts, SQL server, Redis cache, Service bus, Key vault",
            "IAC: Automated the Infrastructure creation using Azure DevOps, git, CI\\CD, PowerShell, Bicep, Cli and YML. Automated Disaster recovery. Handled Multiple microservices using Docker.",
            "In-House Ops Portal: Created an inhouse Operation portal using C#, React, SQL",
            "Security: Integrated\\Configured SonarQube, dependabot, Sprinto, Azure Application Gateway, WAF-2, Private networks, Private Gateway, Code Signing (Azure Kry vault as HSM), App service Certificate, Network security group, Firewall etc.",
            "Testing: Configured JMeter and integrated it with Grafana and JTL reporter, migrated all unit tests\\integration tests to point to Cloid instance.",
            "Fire Fight: Part of 24/7 Support team, identified\fixed multiple performance chicken neck’s, crash dumps, Fixed memory\\CPU leak, Configured Alerts and monitoring on both Azure and in Ops Portal.",
            "Individual contributor on product: I have my hands on every corner of the product and the main components of product involves 1 desktop client built on WPF, 1 web client built on React, 2 Server components built on .NET Core and Framework, and couple of individual microservices built on .Net Core.",
            "Documentation: Integrated DocFx in build and configured DocFx template in line with company standards ",
            "Multiple Internal Projects: Format converter service (converts any office files to PDF) using PDFTron, C#, SQL, and Auth0. Indexing search service, Azure Cognitive search etc.",
            "Other Achievements: Presented multiple tech topics in international Dev Conferences, Written couple of technical blogs, Lead a team of 4 and many other things."
        ],
        "id": 1
    },
    {
        "name": "One Identity (Active Roles)",
        "githubLink": "https://www.oneidentity.com/products/active-roles/",
        "techstacks": "LDAP, Powershell, Active Directory, c#, C++, WPF, Web application, MVVM",
        "description": [
            "Migrated most of the On-prem Ad solutions to Azure AD using Azure Graph API, C, C++, C# (console, WPF, Web, Restful API, MVC, MVVM and PowerShell),",
            "Worked on a few Connector tools which will sync all the Azure AD resources to AD using LDAP, C# and SQL",
            "Understood the in-depth concepts of AD, Domain, Domain trusts, SMTP, multiple hops, Azure AD resources, Access control etc.",
            "Configured multiple build pipelines using Classic releases.",
            "Managing the self-hosted TFS Server,"
        ],
        "id": 2
    },
    {
        "name": "jtlreporter",
        "githubLink": "https://jtlreporter.site/",
        "techstacks": "Powershell, c#, BICEP, Docker and Python",
        "description": [
            "One of the contributors to the opensource performance test reporting tool",
            "I worked mainly on possibility to deploy this using Docker and how to deploy it to Azure docker. "
        ],
        "id": 3
    }
]